### Read

In [1]:
import pandas as pd

In [2]:
readExcel = pd.read_excel("temp.xlsx")

In [3]:
readExcel

       1     1.1          11  1.2
0      2     3.0    2.000000    1
1      3     4.0    1.000000    1
2      4     7.0    3.000000    1
3      5     8.5   11.000000    1
4      6    10.4    4.000000    1
..   ...     ...         ...  ...
529  531  1007.9 -239.821429    1
530  532  1009.8 -240.285714    0
531  533  1011.7 -240.750000    0
532  534  1013.6 -241.214286    0
533  535  1015.5 -241.678571    0

[534 rows x 4 columns]

In [4]:
readExcel.head()

   1   1.1    11  1.2
0  2   3.0   2.0    1
1  3   4.0   1.0    1
2  4   7.0   3.0    1
3  5   8.5  11.0    1
4  6  10.4   4.0    1

In [5]:
tes = pd.read_excel('../pythonPractices/temp.xlsx')

In [6]:
tes.head()

   1   1.1    11  1.2
0  2   3.0   2.0    1
1  3   4.0   1.0    1
2  4   7.0   3.0    1
3  5   8.5  11.0    1
4  6  10.4   4.0    1

### Check

In [7]:
readExcel.head()

   1   1.1    11  1.2
0  2   3.0   2.0    1
1  3   4.0   1.0    1
2  4   7.0   3.0    1
3  5   8.5  11.0    1
4  6  10.4   4.0    1

In [8]:
readExcel.shape

(534, 4)

In [9]:
readExcel.columns

Index([1, '1.1', 11, '1.2'], dtype='object')

In [10]:
readExcel.index

RangeIndex(start=0, stop=534, step=1)

In [11]:
readExcel.dtypes

1        int64
1.1    float64
11     float64
1.2      int64
dtype: object

In [12]:
readtxt = pd.read_csv('text.txt',sep='\t',header=None, names=['one'])

In [13]:
readtxt.head()

   one
0    1
1    2
2    3
3    4
4    5

### DataFrame and Series

In [14]:
import numpy as np

In [15]:
S1 = pd.Series([1,'a',3,4])

In [17]:
S1

0    1
1    a
2    3
3    4
dtype: object

In [18]:
S1.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
S1.values

array([1, 'a', 3, 4], dtype=object)

In [21]:
s2 = pd.Series([1,'a',3,4],index=['a','b','c','d'])

In [22]:
s2

a    1
b    a
c    3
d    4
dtype: object

In [23]:
dic = {'a':1,'b':2}
s3 = pd.Series(dic)

In [24]:
s3

a    1
b    2
dtype: int64

In [26]:
data = {
    
    'a':[1,2,3,4],
    'b':[5,6,7,8],
    'c':[1,4,5,9]
}
df =pd.DataFrame(data)

In [27]:
df

   a  b  c
0  1  5  1
1  2  6  4
2  3  7  5
3  4  8  9

In [29]:
df.dtypes

a    int64
b    int64
c    int64
dtype: object

In [32]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [33]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [35]:
df['b']

0    5
1    6
2    7
3    8
Name: b, dtype: int64

In [36]:
df.loc[1:3]

   a  b  c
1  2  6  4
2  3  7  5
3  4  8  9

In [54]:
df

   a  b  c
0  1  5  1
1  2  6  4
2  3  7  5
3  4  8  9

In [55]:
df.set_index('a',inplace=True)

In [56]:
df

   b  c
a
1  5  1
2  6  4
3  7  5
4  8  9

In [57]:
df.index

Int64Index([1, 2, 3, 4], dtype='int64', name='a')

In [62]:
df.loc[3,'b']

7

In [63]:
df.loc[3,['b','c']]

b    7
c    5
Name: 3, dtype: int64

In [64]:
df.loc[[2,3],['b','c']]

   b  c
a
2  6  4
3  7  5

In [65]:
df.loc[1:3,['b','c']]

   b  c
a
1  5  1
2  6  4
3  7  5

In [66]:
df.loc[df['b']<7,:]

   b  c
a
1  5  1
2  6  4

In [67]:
df['b']<7

a
1     True
2     True
3    False
4    False
Name: b, dtype: bool

In [68]:
df.loc[lambda df: (df['b']<7) & (df['c']>1),:]

   b  c
a
2  6  4

In [69]:
df1 = df

In [70]:
df1

   b  c
a
1  5  1
2  6  4
3  7  5
4  8  9

In [71]:
df1['c'] = df1['b']-df1['c']

In [72]:
df1

   b  c
a
1  5  4
2  6  2
3  7  2
4  8 -1

In [81]:
df.loc[:,'d'] = df['b']-df['c']

In [82]:
df

   b  c  d
a
1  5  4  1
2  6  2  4
3  7  2  5
4  8 -1  9

In [83]:
df.loc[:,'d']

a
1    1
2    4
3    5
4    9
Name: d, dtype: int64

In [84]:
df['d']

a
1    1
2    4
3    5
4    9
Name: d, dtype: int64

In [85]:
df['e'] = df['b']-df['c']

In [86]:
df

   b  c  d  e
a
1  5  4  1  1
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [87]:
df.describe()

              b         c         d         e
count  4.000000  4.000000  4.000000  4.000000
mean   6.500000  1.750000  4.750000  4.750000
std    1.290994  2.061553  3.304038  3.304038
min    5.000000 -1.000000  1.000000  1.000000
25%    5.750000  1.250000  3.250000  3.250000
50%    6.500000  2.000000  4.500000  4.500000
75%    7.250000  2.500000  6.000000  6.000000
max    8.000000  4.000000  9.000000  9.000000

In [88]:
df['b'].mean()

6.5

In [89]:
df.mean()

b    6.50
c    1.75
d    4.75
e    4.75
dtype: float64

In [90]:
df.max()

b    8
c    4
d    9
e    9
dtype: int64

In [91]:
df.min()

b    5
c   -1
d    1
e    1
dtype: int64

In [94]:
df.cov()

          b     c          d          e
b  1.666667 -2.50   4.166667   4.166667
c -2.500000  4.25  -6.750000  -6.750000
d  4.166667 -6.75  10.916667  10.916667
e  4.166667 -6.75  10.916667  10.916667

In [95]:
df.corr()

          b         c         d         e
b  1.000000 -0.939336  0.976831  0.976831
c -0.939336  1.000000 -0.990979 -0.990979
d  0.976831 -0.990979  1.000000  1.000000
e  0.976831 -0.990979  1.000000  1.000000

In [96]:
df.isnull()

       b      c      d      e
a
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [98]:
df.fillna({'e':0}, inplace =True)

In [99]:
df

   b  c  d  e
a
1  5  4  1  1
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [102]:
df['c'].sort_values()

a
4   -1
2    2
3    2
1    4
Name: c, dtype: int64

In [106]:
df.sort_values(by='c',ascending=True)

   b  c  d  e
a
4  8 -1  9  9
2  6  2  4  4
3  7  2  5  5
1  5  4  1  1

In [104]:
df

   b  c  d  e
a
1  5  4  1  1
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [107]:
df.drop("e",axis=1)

   b  c  d
a
1  5  4  1
2  6  2  4
3  7  2  5
4  8 -1  9

In [108]:
df.drop(1,axis=0)

   b  c  d  e
a
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [120]:
dat = {
    'h':[1,2,3,4],
    'j':[6,7,8,9],
    'k':[1,3,4,5]
}
df2 = pd.DataFrame(dat,index=[1,2,3,4])

In [121]:
df2

   h  j  k
1  1  6  1
2  2  7  3
3  3  8  4
4  4  9  5

In [122]:
df

   b  c  d  e
a
1  5  4  1  1
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [123]:
pd.concat([df,df2],axis = 1)

   b  c  d  e  h  j  k
1  5  4  1  1  1  6  1
2  6  2  4  4  2  7  3
3  7  2  5  5  3  8  4
4  8 -1  9  9  4  9  5

In [124]:
df

   b  c  d  e
a
1  5  4  1  1
2  6  2  4  4
3  7  2  5  5
4  8 -1  9  9

In [127]:
df.index-=1

In [128]:
df

   b  c  d  e
a
0  5  4  1  1
1  6  2  4  4
2  7  2  5  5
3  8 -1  9  9